In [2]:
## installation 
import numpy as np
import pandas as pd

In [5]:
##checking version
pd.__version__

'2.2.3'

In [14]:
info = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [15]:
##create a dataframe from above dictionary

df=pd.DataFrame(data=info,index=labels)

In [17]:
##Return the first 3 rows of the DataFrame df.

df.head(3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [22]:
##Select just the 'animal' and 'age' columns from the DataFrame df

df[['animal','age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

In [29]:
##Select the data in rows [3, 4, 8] and in columns ['animal', 'age']

df[['animal','age']].iloc[[3,4,8]]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

In [40]:
##Select only the rows where the number of visits is greater than 3.

df[df['visits']>3]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

In [44]:
##Select the rows where the age is missing, i.e. it is NaN.

df[df['age'].isna()]
##or
df[df.age.isna()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [52]:
##Select the rows where the animal is a cat and the age is less than 3

df[(df['animal']=="cat") & (df['age']<3) ]

##or

df[(df.animal=="cat")&(df.age<3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

In [55]:
##Select the rows the age is between 2 and 4 (inclusive).

df[(df.age>=2)&(df.age<=4) ]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

In [75]:
##Change the age in row 'f' to 1.5.

df.loc['f','age']=1.5

In [81]:
##Calculate the sum of all visits in df (i.e. find the total number of visits).

df['visits'].sum()

np.float64(19.0)

In [82]:
##Calculate the mean age for each different animal in df.

df.groupby(['animal'])['age'].mean()

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

In [87]:
##Append a new row 'k' to df with your choice of values for each column. Then delete that row to return the original DataFrame.

df.loc['k']=['Goldfish',1,1,'yes']

##delete

df.drop(index='k',inplace=True)

In [90]:
##Count the number of each type of animal in df.

df['animal'].value_counts()

animal
cat      4
dog      4
snake    2
Name: count, dtype: int64

In [97]:
##Sort df first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order

df.sort_values(['age','visits'],ascending=[0,1])

  animal  age  visits priority
i    dog  7.0     2.0       no
e    dog  5.0     2.0       no
g  snake  4.5     1.0       no
j    dog  3.0     1.0       no
b    cat  3.0     3.0      yes
a    cat  2.5     1.0      yes
f    cat  1.5     3.0       no
c  snake  0.5     2.0       no
h    cat  NaN     1.0      yes
d    dog  NaN     3.0      yes

In [99]:
##The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be True and 'no' should be False.

df.replace({'yes':True,'no':False},inplace=True)

C:\Users\asus\AppData\Local\Temp\ipykernel_9920\1336478361.py:3: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.replace({'yes':True,'no':False},inplace=True)

In [111]:
##In the 'animal' column, change the 'snake' entries to 'python'.

df['animal'].replace({"snake":"python"},inplace=True)

In [3]:
from sklearn.impute import SimpleImputer

In [4]:
df=pd.read_csv('./data/animal.csv')

In [29]:
##21.for each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visits and the values are the mean ages

df.pivot_table(index='animal',columns='visits',values='age',aggfunc='mean')

visits  1.0  2.0   3.0
animal
cat     2.5  NaN  2.25
dog     3.0  6.0   NaN
python  4.5  0.5   NaN

In [31]:
##22.How do you filter out rows which contain the same integer as the row immediately above?

df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df[df['A'].ne(df['A'].shift())]

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

In [51]:
##23.how do you subtract the row mean from each element in the row?

df=pd.DataFrame(np.random.random(size=(5,3)))

df=df - df.mean()
df

          0         1         2
0  0.066050  0.342291 -0.488125
1  0.392603 -0.008837  0.290467
2 -0.185445 -0.200783 -0.056772
3 -0.050949 -0.161019  0.049790
4 -0.222259  0.028348  0.204640

In [ ]:
##24.